package com.kco.thread.test12.demo;

import java.util.Random;

/**
 * com.kco
 * Created by swlv on 2016/10/31.
 */
public class Food {
    public final static String[] food = {
            "打边炉","奶味芦笋汤","糟片鸭","烤花揽桂鱼","苦中作乐","七星丸","鸭黄豆腐","贝丝扒菜胆","脆炒南瓜丝","龙凤双腿",
            "大杂烩","复元汤","清烩海参","网油鱼包","煎连壳蟹","拌莴笋","乳酸菌果汁酱","蛋拌豆腐","徽州桃脂烧肉","燕窝炖雪梨",
            "瑞士排骨","香露全鸡","香炸琵琶虾","鱼香牛肉丝","罗汉果焖瓜子鸡","珊瑚桂鱼","水煮牛肉","银杞明目汤","开屏柴把桂鱼","板栗烧鸡",
            "菊花青鱼","烩鸭四宝","灵芝鸡汤","金银菜东菇墨鱼煲猪踭","芪蒸鹌鹑","三色龙虾","古法扣全端","海鲜拼盘","干炸响铃","红烧寒菌",
            "酸汤龙骨面","炸蒸肉","蜜汁金枣","青蒜鲤鱼汤","首乌肝片","炒血鸭","粟米香菇排骨汤","羊肉汤锅","芦笋牛肉","丁香鸭",
            "清汤燕菜","潇湘猪手","三菇浸鱼云","龙须燕丸","煎丸子","金龙乳猪","乡村嫩鸡","椒盐排骨","尤溪卜鸭","清汤柳叶燕菜",
            "家乡南肉","芹黄鱼丝","参杞羊头","玻璃鱿鱼","梨花豆腐汤","醋熘鸡","干贝水晶鸡","酸辣土豆丝","炒豌豆夹","酸辣肘子",
            "红枣炖蚕蛹","沙锅鳝鱼","龙身凤尾虾","冬菜肉末","板栗烧菜心","西汁乳鸽","栗子白菜","珍珠酥皮鸡","金陵片皮鸭","菠萝龙眼鱼",
            "四喜鸭子","蒲江蟹羹","扬州干丝","川芎茶","水煮猪杂","白果烧鸡","梅菜蒸鱼尾","麻婆豆腐","炊太极虾","生炒海蚌",
            "双菇炖南蛇","粉蒸排骨","焖大虾","什锦烩饭","油豆腐镶肉","车前子油焖虾","麻辣田鸡腿","姜汁热味鸡","雪花鱼翅","扁豆薏米炖鸡脚",
            "雪梨肘棒","东坡墨鱼","牛蒡沙拉","鱼香荷包蛋","玉兔海参","彩椒鲜虾仁","正宗重庆辣子鸡","鸡丝海蜇","鱼胶圆肉炖水鸭","好丝百叶",
            "佛跳墙","翠竹粉蒸鱼","馄饨香蕉卷","扳指干贝","凉拌茄子","珊瑚金钩","毛肚火锅","豆瓣鱼","拌鸡块","贵妃鸡翅",
            "生炊麒麟鱼","糟油青鱼划水","果汁鹌鹑","芝麻兔","罗汉果八珍汤","豆鼓鱼","鸡蹄花","三蛇羹","砂锅鱿鱼","沛县狗肉",
            "腐皮虾包","苹果炖鱼","叉烧鱼","锅贴鸡片","七星鱼丸汤","杨梅虾球","酿茄子","南煎丸子","糖醋红柿椒","青椒肉片",
            "红烧果子狸","火爆肚头","菊花猪肝汤","油爆双脆","香辣虾","八生火锅","红椒爆鲜虾","砂锅三味","秘制国药中华鳖","蜜汁梨球",
            "乌发汤","火鞭牛肉","甘菊猪肚","雪花片汤","碎米鸡丁","一品鲍鱼","金陵板鸭","板栗仔鸡","蛋酥花仁","口福鸡",
            "糖拌菜心","四川家常酸辣汤","蚂蚁上树","烟熏排骨","口袋豆腐","鹿角菜蛤蚧水鱼汤","玟瑰大虾","可口的葡萄醋","网油叉烧洞庭桂鱼","淳安辣椒酱",
            "脆薯凤尾虾","生熏仔鸡","炖鸡汁","什锦蜂窝豆腐","沙丁鱼烙","荷叶肉","醉蚌肉","红烧牛腩","徽州毛豆腐","双色玫瑰鱼",
            "蜜豆鱼片","芋头扣肉","菠饺鱼肚","鱼腩煲","番茄豆腐炒肉片","水浒肉","舒心驻颜老火汤","白汁鲳鱼","西柠蜜糖乳鸽","西湖莼菜汤",
            "香菇盒","麻辣白菜","藕香芹味","茶叶熏鸡","三丝拌蛏","润肺菜干汤","金钱口蘑汤","辣拌血蛤","麻酱凤尾","清香炒悟鸡",
            "糟熘鱼片","鱼香茄饼","徽式双冬","南排杂烩","鲜竹牛肉","园林香液鸡","枸杞猪肝瘦肉汤","冬菜扣肉","泡菜炒肉末","芥兰炒香肠",
            "金鱼戏莲","鹅黄肉","人参全鸡煲","西瓜盅","豆腐咸鱼头汤","家常鸡块","红扒羊肉","清汤柴把鸭","辣椒炒肚片","芡实猪肚汤",
            "柠檬鸡","花椒鸡丁","西芹百合草莓炒腊肉","鱼香肉片","馏鱼片","艄公号子鱼","东坡肉","糖粘羊尾","葱辣鱼条","麻辣子鸡",
            "烤方","金陵丸子","蒜香鲶鱼","鱼香肉丝","落叶琵琶虾","杞鞭壮阳汤","糖醋排骨","红烧猴头蘑","东坡鱼","泡菜鱼",
            "三杯鸡","苦瓜酿肉","金钱干贝","麻粉肘子","拔丝苹果","红斑二吃","奶汤鲜核桃仁","麻仁香酥鸭","昆布海澡瘦肉汤","牛腩煲",
            "炸灌汤丸子","糖醋鸡块","凤梨烩排骨","咖喱海鲜锅","瓤莲藕","酸辣臊子蹄筋","粉蒸牛肉","锅巴肉片","雪花鸡淖","红烧蹄筋",
            "樟茶鸭","拆冻鲫鱼","沙参玉竹老鸭汤","纸包鸡","整鱼两吃","酒香椒盐肘子","干煸四季豆","水晶蹄膀香肴肉","鱼羊鲜","客家酿豆腐",
            "茄汁明虾","黑鸡拆烩老猫公","虎跑素火煺","葛根清肺汤","花雕鸡","水煮鱼","酥炸春花肉","池塘莲花","椒盐蹄膀","酸菜鱼",
            "龙潭钓玉牌","槐花猪肠汤","生爆盐煎肉","川味牛肉","荷包豆腐","鹰扬虎视","鲜粟子鸡肉汤","鸭掌包","麻油火鸡肾","双烤肉",
            "烤花揽鳜鱼","扒酿海参","酿豆腐","茄汁鱼卷","花菇田鸡","炒鸡什件","梅菜扣肉","彩色肉丝","炸菠菜脯","豆腐鲫鱼",
            "黄泥煨鸡","辣白菜","干蒸黄鱼","奶汤蒲菜","三皮丝","干锅手撕包菜","软烧豆腐","烤扁担肉","糖醋鸡圆","白焯响螺",
            "马铃薯笋焖鸡","辣子肉丁","鸡汤煮干丝","银耳杏仁百合汤","山东菜丸","东坡肘子","金钱芝麻虾","开水白菜","剁椒鱼头","发丝百叶",
            "软炸虾糕","组庵鱼翅","鱼香腰花","泰山赤鳞鱼","浅色海鲜豉油","肉酿生麸圆","炸鸡排","杭州煨鸡","荷叶粉蒸肉","姜汁热窝鸡",
            "火烘鱼","香蕉百合银耳汤","五香脆皮鸡","蝴蝶飘海","吉利大虾","银杏蒸鸭","凉粉鲫鱼","干煸冬笋","爆炒腰花","炸豆腐丸子",
            "盐煎肉","网油腰卷","百仁全鸭","虾胶龙凤卷","龙眼甜烧白","羊耳鸡塔","红枣煨肘","恋爱豆腐","炖牛掌","杏仁银肺汤",
            "海参盆蒸","炒面线","山楂肉干","红烧鱼唇","香酥焖肉","水晶南瓜","原笼玉簪","凉瓜浸田鸡","姜丝肉蟹","辣椒蟹",
            "玉竹心子","酸辣鸡丁","火爆双脆","清炖蟹粉狮子头","红油耳片","兰度鸽脯","虾爆鳝背","参蒸鳝段","炸子鸡","西红柿肉片汤",
            "生炒蒜苔肉","糖醋鱼","酱爆肉","肴肉","麻辣豆腐","湘西酸肉","酥皮龙虾","蒜苗火鸡排","桃酥鸡糕","三丝鱼翅",
            "清炖马蹄鳖","三套鸭","炝黄瓜","换心乌贼","黄焖鸡块","荷叶粉蒸鸡","干烧牛肉片","鱼香豆腐","大众菜","白玉翡翠",
            "清蒸青鳝","五柳脆皮鱼","箩粉鱼头豆腐汤","牛膝蹄筋","特色菜","豆瓣肘子","盐水肫花","成都蛋汤","荷叶凤脯","百合炒鱼片",
            "京乳藕片","冬瓜燕","麻仁当归猪踭汤","烤小鸡","凉拌怪味鸡","山楂核桃茶番茄海蜇","烧罗汉面筋","莲子山药粥","毛峰熏鲥鱼","酱焖鲫鱼",
            "洞庭金龟","连锅汤","棒棒鸡","素火腿","爆人参鸡片","辣子鸡丁","西柚三文鱼","梅干菜烧肉","甜椒肉丝","砂仁肚条",
            "芝麻鱼球","白汁圆菜","鸡丝米粉","芹黄烧鱼条","坛子肉","紫龙脱袍","双味蹄筋","魔芋烧鸭","油焖春笋铁扒仔鸡","豆苗炒鸡片",
            "清汤银耳","肉酿生麸","水晶肴蹄","虾米拌豆腐","香酥鸭","熬黄花鱼","罗汉果西洋菜猪踭汤","潮州肉冻","干烧鱼翅","东安子鸡",
            "香菇豆腐饼","醋熘土豆丝","板栗焖仔鸡","菜心炒猪肝","瓤甜椒","芦笋煎黄菜","猴头菇炖竹丝鸡","金香饼","可乐鸡翅","辣椒鱼",
            "桑杏炖猪肺","沙司牛尾","巴国玉米糕","蜜汁叉烧","麻辣猪肝","五花肉炒豆腐泡菜","葵花虾饼","椒盐肚尖","西式芦笋汤","金钱海参",
            "醉排骨","五彩牛肉丝","麻辣肉丁","厦门薄饼","酸辣狗肉","八大锤","一品豆腐汤","锅塌鸡签","香橙糕","川西肉豆腐",
            "干炒牛河","老妈子带鱼","客家小炒","蛤蜊黄鱼羹","豆瓣鲫鱼","黄山炖鸽","豆瓣海参","肉米鱼唇","子萝鸭片","参果炖瘦肉",
            "椒麻鸡","古老肉","炸班指","南肉春笋","叫化童鸡","手撕鸡","鲜椒嫩仔鸡","糊涂鸡","口味虾","太白鸭子",
            "南荠烧鸭丁","生鱼葛菜汤","干煸肉丝","香煎茄片","腌鲜鳜鱼","红烧猪蹄","回锅肉","龙井虾仁","拉糟鱼块","菜干鸭肾蜜枣汤",
            "红烧猪手","油焖春笋","麻油鸡","沙参心肺汤","灯影苕片","奶汤银肺","番茄蛋花汤","重庆毛血旺","枸杞海参鸽蛋","烧瓤鲜沙虫",
            "金钩青菜心","生烧筋尾舌","榨菜肉丝","咸菜焖猪肉","南卤醉虾","瓜薏米淡菜汤","香荽鱼松酿银萝","水煮肉片","家常海参","香油石鳞",
            "香酥山药","果仁排骨","芙蓉煎滑蛋","花生红米饭","海米烧菜花","酸辣口水鸡","八珍鲩鱼","炒桂花鱼翅","酸菜肚片汤","杂豆小麦粥",
            "马蹄鸡丁","双菜炒素鸡","冰糖湘莲","全虾三做","蟹黄虾盅","剑花蜜枣猪肺汤","韭菜炒肉","广式卤鸭翅","银耳川鸭","龙眼咸烧白",
            "蜜椒蝴蝶片","酥炸牛肉卷","连理双味鱼","醋溜黄瓜","陆稿荐酱猪头肉","火爆荔枝腰","爆炒羊肚","三菌炖鸡","米茸芋丝虾煲","荔枝肉",
            "溜肝尖","清炖全鸡","棒棒鸡丝","苕菜狮子头","酸辣白菜","炝三丝","胡椒海参汤","客家盐焗鸡","红烧狮子头","虫草鸭舌",
            "蚝皇凤爪","蓉城鸳鸯卷","黄豆芽排骨豆腐汤","玉米羹","走油豆鼓扣肉","芝麻肉丝","鲜花豆腐","油条西舌","枸杞煨鸡汤","红烧卷筒鸡",
            "玉兔葵菜尖","苹果牛肉炖煮","陈皮鸡","雪梨猪踭汤","果仁徘骨","浦江蟹羹","绣球鱼翅","一品鲳","蛏溜奇","油淋笋鸡",
            "酥盐鸡块","片皮挂炉鸭","豆苗炒虾片","红烧肉","广式烧填鸭","风情羊柳","夫妻肺片","夹沙肉","粉蒸鸡","赛蟹羹",
            "虫草鹌鹑","荷叶鸡","闽生果","泡菜肉末","乌骨鸡归黄汤","干煸鳝鱼丝","什锦豆腐煲","虾须牛肉","牛蒡香羹","软炸白花鸽",
            "陈皮牛肉","葱辣鱼","龙眼凤肝","一品海参","萝卜泡菜","软烧仔鲇","炸馓子","鸡豆花","素锅烤鸭","泰安三美豆腐",
            "香椿白肉丝","西湖醋鱼","海参炖瘦肉","七彩瓤猪肚","凉拌海蜇","密汁牛蒡","荷叶蒸肉","凤尾金鱼","白汁鱼肚","玉须泥鳅汤",
            "小煎鸡","网油包烧鸡","酿青椒","鱼咬羊","豆泥红枣","炸珍珠虾","蚝油生菜","参麦团鱼","辣炒鱿鱼丝","皮蛋豆腐",
            "奶汁肥王鱼","珍珠圆子","三虾豆腐","润燥黄豆肉排汤","蒜烧排骨","麻酱白菜丝","嘉禾雁扣","干锅腊味河蚌","福山烧小鸡","清水白菜",
            "浪花天香鱼","铁狮子头","火爆腰花","蒜子焖酣鱼","无锡肉骨头","麻酱拌豆腐","一品酥方","叫化鸡","炸八块","马蹄白果蛋花汤",
            "干菜焖肉","元宝牛蒡","火腿炒茄瓜","锅贴鱼片","酱酥桃仁","冬菇烧蹄筋","红烧舌尾","红杞活鱼","软溜珠廉鱼","芪烧活鱼",
            "丝瓜卤蒸黄鱼","荷包鱿鱼","炸花仁腰块","凉瓜肉排汤","樟茶鸭子","豆渣猪头","荤罗汉","芝麻豆腐","荔枝鱿鱼卷","合川肉片",
            "玻璃鲜墨","筒子肉","腊味合蒸","锅烧鸭","土豆炖豆角","清风送爽","荷花豆腐大虾","蚕豆炒虾仁","金钱鸡塔","椰盅海皇",
            "淡菜紫菜瘦肉汤","银杏芋泥","凤尾虾","酸辣海参","鸡包鱼翅","红糟排骨","锅烧鸡","芙蓉鲫鱼","酱爆鸭块","鱼香碎滑肉",
            "玛瑙银杏","秘制鸳鸯鸡","沸腾羊肉","东安鸡","鸡蛋炒西红柿","川菜名菜","红油抄手","黔味大虾","石榴鸡","椒盐八宝鸡",
            "芥菜咸蛋鱼头汤","炒芙蓉蟹","清炖鸡孚","宫保鸡丁","干煸鳝背","香酥凤腿","番茄松鼠鱼","紫桂焖大排","太极芋头","皱纹圆蹄",
            "炒豆腐脑","李鸿章杂烩"
    };

    private static Random random = new Random();
    public static String getRandomFood(){
        return food[random.nextInt(food.length)];
    }
}
